// 2025-04-25 라면 사기 (Small)
// 그리디 알고리즘
#include <bits/stdc++.h>
using namespace std;

int arr[1000004];

int main(){

    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    int n;
    cin >> n;

    for(int i = 0; i < n; i++) {
        cin >> arr[i];
    }

    long long ans = 0;

    for(int i = 0; i<n; i++){
        long long k;
        if(arr[i+1] > arr[i+2]){
            k = min(arr[i], arr[i+1] - arr[i+2]);
            ans += k * 5;
            arr[i] -= k;
            arr[i+1] -= k;
        }
        k = min({arr[i], arr[i+1], arr[i+2]});
        ans += k * 7;
        arr[i] -= k; arr[i+1] -= k; arr[i+2] -= k;

        k = min(arr[i], arr[i+1]);
        ans += k * 5;
        arr[i] -= k; arr[i+1] -= k;

        ans += arr[i] * 3;
        arr[i] = 0;
    }

    cout << ans;
}

/*
1 2 3 5 6
무조건 3개가 이득

3 1 2 5 6
2개 -> 2 0 2 5 6
3개 -> 2 0 1 5 6 무조건 3개가 이득

2 1 3 5 6
2개 -> 1 0 3 5 6
3개 -> 1 0 2 5 6 무조건 3개가 이득

1 3 2 5 6
2개 -> 0 2 2 5 6
3개 -> 0 2 1 5 6 무조건 3개가 이득

3 2 1 5 6
2개
1 0 1 5 6 10
0 0 1 5 6 13
0 0 0 4 5 20
0 0 0 0 1 40 43
3개
2 1 0 5 6 7
1 0 0 5 6 12
0 0 0 5 6 15
0 0 0 0 1 40 43

2 3 1 5 6
2개
0 1 1 5 6  10
0 0 0 4 6  17
0 0 0 0 2  37
0 0 0 0 0  43
3개
1 2 0 5 6  7
0 1 0 5 6  12
0 0 0 5 6  15
0 0 0 0 1  40 43

2 5 1 7 4
2개
0 3 1 7 4 10
0 2 0 6 4 17
0 0 0 6 4 23
0 0 0 2 0 43
0 0 0 0 0 49 2개가 이득?


3개
1 4 0 7 4 7
0 3 0 7 4 12
0 0 0 7 4 21
0 0 0 3 0 41
0 0 0 0 0 50


2 5 3 7 4
0 3 3 7 4 10
0 0 0 4 4 31
0 0 0 0 0 51 2개가 이득

0 3 1 7 4 14
0 2 0 6 4 21
0 0 0 6 4 27
0 0 0 2 0 47
0 0 0 0 0 53


4 5 3 7 4

0 1 3 7 4 20
0 0 2 6 4 27
0 0 0 4 4 37
0 0 0 0 0 57

2 3 3 7 4 10
0 1 1 7 4 24
0 0 0 6 4 31
0 0 0 2 0 51
0 0 0 0 0 57


1 2 0 7 4 21
0 1 0 7 4 26
0 0 0 7 4 29
0 0 0 3 0 49 58


*/